[
  
  {
  "id": "bike-detour-skytrain",
  "title": "Bike Detour Beats the SkyTrain Blues",
  "image": "./images/blog-bike-detour-skytrain.jpg",
  "tldr": "I traded the packed SkyTrain for sunshine, throwback tunes, a surprise photo shoot, and wild blackberries.",
  "fullContent": "The SkyTrain was crowded and the sun was shining bright... hmm, yeah let's do it. I'm hopping off 4 stops early! The extra time on two wheels and the wind blowing on my face is better in every way I can think of right now.\n\nI’ve got some mellow tunes playing on my AirPods, but I’m craving something different. My main playlist’s feeling a bit overplayed. Let’s try… 2010 Throwbacks! Calvin Harris and Coldplay right out of the gate—haha, perfect tunes for the ride home.\n\nToo bad I didn’t get very far. I passed this empty lot and had that familiar thought again: *This would be a great photo.* I’m so tired of that feeling—seeing potential shots and doing nothing about it. So I went against my grain (lately I’ve just been letting them pass) and turned back.\n\nI don’t know what you’d “call” the photo, but it spoke to me. So many layered elements: three levels of overpass architecture cutting through the sky, concrete columns falling perfectly on the thirds, the River Rock Casino landmark in the distance, and an abandoned lot in one of Richmond’s half-zoned industrial spaces. Littered with old mattresses, empty propane tanks, garbage, and the classic end-of-July special... drumroll... **blackberries**.\n\nBlackberries love abandoned places—they know they can get away with growing wild. And I’ll be there to take full advantage of those tasty (and not-so-little) treats.\n\nSee my 2024 post for the time I *almost accidentally sacrificed someone* to the thorny fate of a blackberry ravine. (Yeah... that sentence might need rewording.)",
  "theme": "Everyday Moments",
  "date": "July 29, 2025"
},

  
  {
    "id": "ikea-hot-dog",
    "title": "The IKEA Hot Dog and Human Connection",
    "image": "./images/blog-ikea-full.jpeg",
    "tldr": "Helped an old lady at IKEA self-order, realizing automation isn't always accessible. Human connection and backup plans are vital.",
    "fullContent": "I was at IKEA ordering some veggie dogs and an ice cream and overheard an old lady telling the cashiers at the grab and go food court that she just wants to order a coffee quickly and she has no idea how to use the self order machines. She was being super nice and not rude at all, but not to her luck, the food court workers wouldn't help her or even entertain her, just telling her to go use the machines. I felt really bad because the older lady was being so genuine and it kind of felt like one of those moments where she was really feeling out of place. I walked over to her and interrupted the conversation and asked if she would like me to help her with the self order machine. The look of relief on her face was more thanks than could be said with words.\n\nI really took my time showing her how it worked, and explaining each step in case she decided she wanted another coffee in the near future. I also told her about some common design flaws in the user flow in ordering that I come across often. I added a bit of humour in there to kind of lighten the stress because she was a bit flustered at the start.\n\nShe was truly thankful and she passed that onto me, all the good feelings.\n\nI know workers can't really leave their post behind the counter to help out everybody who doesn't understand how to use the machines. I mean, they are pretty easy. But if I put myself in the position of someone older who stays away from all the new tech that's exploding in our environments, I'd have to say it might be a mixture of being scared, frustrated, and just that feeling of \"I just want to talk to someone like I used to do my whole life.\"\n\nSometimes automation, shortcuts, and efficiency aren't the most accessible, even if they are intended to be.\n\nLike an alt tag on an image, an 'else' in case of the 'if' (JavaScript reference, please review), or a manual override, having a default or backup plan like actual workers still being able to take your order for those 2% of people that might need it is and should always be an option.",
    "theme": "Personal Anecdote",
    "date": "July 8, 2025"
  },
  {
    "id": "burnt-toast-smell",
    "title": "The Unpopular Opinion: Love for Burnt Toast",
    "image": "./images/blog-toast-full.jpg",
    "tldr": "The smell of burnt toast reminds me of childhood camping and making fires from old coals. It's a comforting, nostalgic scent.",
    "fullContent": "Love the smell of Burnt toast. Is it an unpopular opinion? Whether it's just bread or croissants, that deep smell of char reminds me of so many different things. Like a whirlwind of good feelings and memories.\n\nWhen I was a kid, I would always try to wake up first camping, crawling out of my nice warm, sleeping bag into that damp morning air, walking over to the fire pit, hoping that there would be some orange coals laying under a bed of white ash. I would stir around with a stick until I could find some. Using some old newspaper or whatever was laying around, I would blow on those coals to get the fire going again.\nIt was always so rewarding, making a new fire from the remains of an old one, like it was some camping victory, haha.\nThe first thing I would cook would be some toast. I love the way it would get toasted, leaving the grill marks of whatever we used on that camping trip. More often than not, there would be at least one section that was burnt. If you have gone camping, chances are you might know this flavor and taste.",
    "theme": "Memories",
    "date": "April 18, 2025"
  },
  {
    "id": "turn-off-your-flashlight",
    "title": "Turn Off Your Flashlight: A Lesson in Awareness",
    "image": "./images/blog-TurnOffYourFlashlight.jpg",
    "tldr": "At a fireworks show, a lady's bright phone flashlight annoyed everyone. I politely asked her to turn it off, and she did. Small actions can make a big difference.",
    "fullContent": "Is what I said to some random lady who was lacking spatial awareness. Hundreds of people line the edge of English Bay, awaiting the fireworks and drone show to start for the celebration of lights festival.\nBut really we're not trying to celebrate your flashlight on your iPhone. So when you arrive late to the show and walk in front of everybody who has been sitting here patiently and somehow have your flashlight on while making a phone call waving it around, back-and-forth like you're sending a signal to somebody… it's painful to see the situation and painful with that bright flashlight in your eyes.\n\nI was kind of brushing it off and just going to deal with it, but when the show started and she's directly in the line of sight it's kind of ruining the moment. Seeing everybody around me, verbally complaining, and no one doing anything I decided to get up and let her know.\nI almost fell over an old log that washed up on the shore when I was jumping down to her (that would've been super embarrassing)\n\nI let her know the flashlight was on and she was super nice about it saying she had no idea (obviously she had no idea ahahahaha)\n\nI got a few \"attaboys\" out of approvals, which made me feel like “mission accomplished” now sitting back down on my rock to enjoy the show with my kiddos! Everyone happy!\n\nYou don’t need to be angry at someone's actions, you just need to spread awareness to people who need it, and hope they have the place to accept it.",
    "theme": "Observation",
    "date": "July 18, 2025"
  },
  {
    "id": "lost-at-skytrain",
    "title": "Lost at the Skytrain: A Commuter's Observation",
    "image": "./images/blog-doyouneedhelp.jpg",
    "tldr": "Helped a confused couple at a train station, but they still got on the wrong train. It made me reflect on how I used to be lost in the city, and now I'm used to it.",
    "fullContent": "Do you need help finding something? You seem lost, I asked a couple at one of the busiest transfer skytrain stations. “Yes” “we're trying to get to xxxxx, do you know which train to take?” I let them know they were on the right side and where it would take them.\n\nThey still seemed confused so I asked them about where they needed to go for that day. They explained to me the things they wanted to do. And all of it was definitely the direction we were going. After we confirmed it all a few times they finally seemed like they're confident they knew where they were going.\n\nBut about five seconds before the doors closed, they ran out the door onto the station and jumped through the doors of the opposite direction train like a scene out of Indiana Jones.\n\nI couldn't help but actually laugh out loud, wondering if they were scared of me or if they were just super confused about where they were going. To this day I assume they are still lost somewhere in the Vancouver train network, hahaha.\n\nReflecting on the situation, I do remember how confused I was when I first came to the city. Constantly looking at the printed map on the walls. Frantically checking the digital display for the next stops. And now I'm numb to it all. Sometimes nodding off to sleep a little bit when I'm sleep deprived and somehow seamlessly waking up and becoming alert when it's my stop like I am on some internal clock. Who am I kidding? I think we all have an internal clock that is running us from the inside.\n\nSee future post for my thoughts on all the little things that are running us from the inside 😂",
    "theme": "Daily Life",
    "date": "June 15, 2025"
  },
  {
    "id": "street-musician",
    "title": "The Street Musician's Unpaid Fan",
    "image": "./images/blog-music.jpg",
    "tldr": "I love the street musician's music on my commute, even though I don't give him money. I show support by taking off my headphones and genuinely listening.",
    "fullContent": "I don’t carry spare change but I love your music, three out of four times the same street musician is in the same spot each morning on the routine commute.\n\nI genuinely love his music and electric guitar and a little amp. I don't want to pay him. I don't know why, even if he had that little E tap card reader, I most likely still wouldn't do it. I also don't have a lot of extra money so that could be another reason. What do I have to give?\nWhen I pass by, I always take off my headphones, I'm not sure if he noticed this, but if he did, I hope he can see that for the moment that I'm near him, I'd rather be listening to what he's playing compared to anything that's on my headphones.\nAnd I imagine the reason he is there is to make a bit of extra money to help his life out, but I would hope the second reason would be that he loves playing music. I think that because you can hear it when he plays.\nThat's the thing that I'm supporting.",
    "theme": "Observation",
    "date": "Januray 23, 2025"
  },
  {
    "id": "ai-targeted-memory",
    "title": "AI and Targeted Memory: Bringing Memories to Reality",
    "image": "./images/blog-memories.avif",
    "tldr": "What if AI could recreate memories for dementia patients, like my grandma's childhood stories, using old photos and mapping?",
    "fullContent": "If my grandmother has dementia and memory loss, she constantly tells stories about when she was a child, and the things she used to do, sneaking in the cellar to get apples without her dad knowing, because it was the only sweet things she could get. Or flipping the hay in the sun, so both sides could dry.\n\nWhat if there could be a creation of that for her to see?\n\nAI targeted memory like video to assist with bringing memories to reality, integration with pictures and mapping.",
    "theme": "Future Tech",
    "date": "March 12, 2025"
  },
  {
    "id": "bike-path-speed",
    "title": "The Bike Path Speed Limit: A Lesson in Perspective",
    "image": "./images/blog-bikelane.jpg",
    "tldr": "Got yelled at for speeding on a bike path. Realized many bikers go too fast, making it unsafe for others. A lesson in empathy.",
    "fullContent": "I was biking to school on a green path (shared biking and walking) and an older man yelled at me that I was breaking the 15 km/h speed limit.\n\nAt first, I thought, “How dare you say that to me?” I know how fast I was going, and I’m always looking at that speed sign.\n\nI wanted to turn my bike around and ask him to mind his own business, of course, that’s a pretty impulse thought and I didn’t really even come close to turning around.\n\nAfter that though, I started noticing how fast bikers actually go on the path. There are signs saying it’s a leisure path and if you want to go fast, just use the bike lanes on the road (3m away).\n\nI noticed full racing road bikes, electric bikes, and even electric scooters, some pushing the 40km/h mark.\n\nIt was then I realized why that man was upset; he was sick of being bombed by every few minutes. On a leisure trail!\n\nIt’s really incredible that sometimes you are blind to your surroundings until something just clicks.\n\nAnd for anyone who read this far and is curious about my speed, it was 14 km/h 😇\n\nUnrelated... I see a lot of familiar faces each morning. I’d love to start a little nod when passing by one of them, just a subtle “morning’ to ya.” I’m not sure why I’d like that, but it feels like it might be a little 1% good feeling thing to start your day better.\n\nEven more off-topic?... Have you ever seen something or had an interaction that made you smile just the tiniest amount, the corners of your mouth move just the faintest amount, and a quick wave of happiness washes over you? None of that lasts very long... or maybe it does! Regardless, that would be the feeling I’d expect from the little head nod 🙂‍↕️",
    "theme": "Observation",
    "date": "July 13, 2025"
  },
  {
    "id": "train-screech",
    "title": "Is everybody just going to stand there?",
    "image": "./images/blog-trainscreech.jpg",
    "tldr": "On my train commute, a loud screech from an open window annoyed everyone, but no one closed it. I did, realizing small actions can make a big difference.",
    "fullContent": "Commuting to school on the train each morning can be interesting. You never really know what you're going to see. This morning it wasn't really about what you could see, but what you could hear.\nTerrible screech of steel on steel. I guess I can consider myself lucky because I get to ride on the smoothest rail line in the city. With only two major areas in the line between terminus stations it's not bad.\n\nTwo different 45° banked turns produce a deafening screech that's usually not heard because the train cars are so heavily insulated. But thanks to someone leaving a window open, everyone without noise-cancelling headphones gets to experience this lovely sound.\n\nWith 10 people close enough to touch the window, why does no one make an effort to shut it? Even with large labels on the window saying \"please keep shut.\" Nothing seems to prompt them to complete the simple task.\n\nA quick gaze around the area I'm standing and at least 75% of the people have a look on their face of “OMG that sound is the worst.”\n\nAs we approached the next station and the mixture of people getting on and off, opened up the area slightly, I danced around a few people and shut the window.\nIt snapped shut so effortlessly like it wanted to be closed the whole time. I almost wanted to open and close it a few times because of how satisfying the movement was. (Obviously, I didn't go ahead and do that. Haha)\n\nDo we live in a world where people don’t take actions to mitigate things around them? Small changes by many affect things on a bigger scale than we would even know!\n\nLater that day, the mayor gave me the key to the city, jokes, jokes (is that even a real thing?)",
    "theme": "Observation",
    "date": "July 23, 2025"
  }
]